Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern
The pattern for how the wires in Fabric Sheet are laid out.

Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern.QuantitativeSpacing
Multiple groups of wires with a specific spacing and diameter

Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern.NumberWithSpacing
Both the spacing between the rebars and the number of rebars are constant based on input.

Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern.MaximumSpacing
The maximum distance between the rebars is specified by input,
and the number of rebars changes based on the length of rebar set.

Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern.FixedNumber
The spacing between the rebars is adjustable,
but the number of bars is constant based on input.

Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern.ActualSpacing
The spacing between the rebars is fixed and specified by input.